<?php

return [
    'plural' => 'المشاريع',
    'singular' => 'المشروع',
    'empty' => 'لا توجد مشاريع',
    'select' => 'اختر المشروع',
    'select-type' => 'الكل',
    'perPage' => 'عدد المشاريع في الصفحة',
    'actions' => [
        'list' => 'عرض المشاريع',
        'show' => 'عرض',
        'create' => 'إضافة مشروع جديد',
        'edit' => 'تعديل المشروع',
        'delete' => 'حذف المشروع',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة المشروع بنجاح .',
        'updated' => 'تم تعديل المشروع بنجاح .',
        'deleted' => 'تم حذف المشروع بنجاح .',
    ],
    'attributes' => [
        'name' => 'اسم المشروع',
        'category' => 'القسم',
        'location' =>  'العنوان',
        'price' => 'السعر',
        'area' => 'المساحة والابعاد',
        'images' => 'الصور',
        'contact' => 'التواصل',
        'user_id' => 'بواسطة',
        'created_at' => 'تاريخ الاضافة',
        'qr' => 'رمز QR',
    ],
    'categories' => [
        'villas' => 'الفلل',
        'buildings' => 'المباني والاراضي',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد انك تريد حذف هذا المشروع ?',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ],
    ],
];
